STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_ble.c
          ret = aci_gatt_confirm_indication(p_indication->Connection_Handle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            /* Impossible to confirm indication due to GATT process ongoing. Notify tmap_app */
            TMAPAPP_ConfirmIndicationRequired(p_indication->Connection_Handle);
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          break;
        }
        case ACI_L2CAP_COC_CONNECT_VSEVT_CODE:
        {
          aci_l2cap_coc_connect_event_rp0 *p_coc_connect;
          p_coc_connect = (aci_l2cap_coc_connect_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_COC_CONNECT_VSEVT_CODE\n");
          LOG_INFO_APP(">>== Connection_Handle : 0x%04X\n", p_coc_connect->Connection_Handle);
          aci_l2cap_coc_connect_confirm(p_coc_connect->Connection_Handle,
                                        p_coc_connect->MTU,
                                        p_coc_connect->MPS,
                                        p_coc_connect->Initial_Credits,
                                        0x01,
                                        0x00,
                                        0x00);
          break;
        }
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
        {
          aci_l2cap_connection_update_req_event_rp0 *p_conn_update;
          p_conn_update = (aci_l2cap_connection_update_req_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE\n");
          LOG_INFO_APP(">>== Connection_Handle : 0x%04X\n", p_conn_update->Connection_Handle);
          LOG_INFO_APP(">>== Interval_Min : 0x%04X\n", p_conn_update->Interval_Min);
          LOG_INFO_APP(">>== Interval_Max : 0x%04X\n", p_conn_update->Interval_Max);
          LOG_INFO_APP(">>== Latency : 0x%04X\n", p_conn_update->Latency);
          LOG_INFO_APP(">>== Timeout_Multiplier : 0x%04X\n", p_conn_update->Timeout_Multiplier);
          LOG_INFO_APP(">>== Identifier : 0x%02X\n", p_conn_update->Identifier);
          aci_l2cap_connection_parameter_update_resp(p_conn_update->Connection_Handle,
                                                     p_conn_update->Interval_Min,
                                                     p_conn_update->Interval_Max,
                                                     p_conn_update->Latency,
                                                     p_conn_update->Timeout_Multiplier,
                                                     0x00,
                                                     0x00,
                                                     p_conn_update->Identifier,
                                                     0x00);
          break;
        }

        case ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
        {
          aci_att_find_by_type_value_resp_event_rp0 *pr = (void*)p_blecore_evt->data;
          BleConn_t *p_conn = Ble_GetConn( pr->Connection_Handle);
          LOG_INFO_APP(">>== ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE\n");
          if (p_conn != 0)
          {
            if (p_conn->GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_SERVICE && pr->Num_of_Handle_Pair == 1)
            {
              /* Retrieve Gatt Service Handles */
              p_conn->GattService.StartHandle = pr->Attribute_Group_Handle_Pair[0].Found_Attribute_Handle;
              p_conn->GattService.EndHandle = pr->Attribute_Group_Handle_Pair[0].Group_End_Handle;
            }
          }
          break;
        }

        case ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE:
        {
          aci_gatt_disc_read_char_by_uuid_resp_event_rp0 *pr = (void*)p_blecore_evt->data;
          BleConn_t *p_conn = Ble_GetConn( pr->Connection_Handle);
          LOG_INFO_APP(">>== ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE\n");
          if (p_conn != 0)
          {
            if (p_conn->GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR)
            {
              /* Retrieve Service Changed Characteristic Handle */
              p_conn->GattService.ServiceChangedCharHandle = pr->Attribute_Handle;
            }
          }
          break;
        }

        case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
        {
          aci_att_find_info_resp_event_rp0 *pr = (void*)p_blecore_evt->data;
          BleConn_t *p_conn = Ble_GetConn( pr->Connection_Handle);
          LOG_INFO_APP(">>== ACI_ATT_FIND_INFO_RESP_VSEVT_CODE\n");

          if (p_conn != 0)
          {
            if ((p_conn->GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR_DESC) \
                && (pr->Event_Data_Length >= 4) \
                && (pr->Handle_UUID_Pair[2] + (pr->Handle_UUID_Pair[3] << 8) == SERVICE_CHANGED_CHARACTERISTIC_UUID))
            {
              /* Retrieve Service Changed Characteristic Descriptor Handle */
              p_conn->GattService.ServiceChangedCharDescHandle = pr->Handle_UUID_Pair[0] + (pr->Handle_UUID_Pair[1] << 8);
            }
          }
          break;
        }

        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          tBleStatus status;
          aci_gatt_proc_complete_event_rp0 *pr = (void*)p_blecore_evt->data;
          BleConn_t *p_conn = Ble_GetConn( pr->Connection_Handle);
          LOG_INFO_APP(">>== ACI_GATT_PROC_COMPLETE_VSEVT_CODE\n");


          if ((p_conn != 0) && (pr->Error_Code == BLE_STATUS_SUCCESS))
          {
            if (p_conn->GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_SERVICE)
            {
              if (p_conn->GattService.StartHandle != 0)
              {
                const UUID_t uuid = { SERVICE_CHANGED_CHARACTERISTIC_UUID };
                /* Start Service Changed Characteristic Discovery */
                status = aci_gatt_disc_char_by_uuid(p_conn->ConnHandle,
                                                    p_conn->GattService.StartHandle,
                                                    p_conn->GattService.EndHandle,
                                                    0x01, &uuid);
                LOG_INFO_APP(">>== aci_gatt_disc_char_by_uuid with status %02X\n", status);

