STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_ble.c
                if (status == BLE_STATUS_SUCCESS)
                {
                  p_conn->GattService.LinkupState = GATT_SERVICE_LINKUP_DISC_CHAR;
                }
                else
                {
                  TMAPAPP_Linkup(p_conn->ConnHandle);
                }
              }
              else
              {
                /* No Gatt Service found */
                TMAPAPP_Linkup(p_conn->ConnHandle);
              }
            }
            else if (p_conn->GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR)
            {
              if (p_conn->GattService.ServiceChangedCharHandle != 0)
              {
                tBleStatus status;
                /* Start Service Changed Characteristic Descriptor */
                status  = aci_gatt_disc_all_char_desc(p_conn->ConnHandle,
                                                      p_conn->GattService.ServiceChangedCharHandle,
                                                      p_conn->GattService.EndHandle);
                LOG_INFO_APP(">>== aci_gatt_disc_all_char_desc with status %02X\n", status);

                if (status == BLE_STATUS_SUCCESS)
                {
                  p_conn->GattService.LinkupState = GATT_SERVICE_LINKUP_DISC_CHAR_DESC;
                }
                else
                {
                  /* No Service changed characteristic */
                  TMAPAPP_Linkup(p_conn->ConnHandle);
                }
              }
              else
              {
                TMAPAPP_Linkup(p_conn->ConnHandle);
              }
            }
            else if (p_conn->GattService.LinkupState == GATT_SERVICE_LINKUP_DISC_CHAR_DESC)
            {
              /* End of Gatt Service Linkup: Store database and start TMAP App Linkup */
              if (p_conn->GattService.ServiceChangedCharDescHandle != 0)
              {
                p_conn->GattService.LinkupState = GATT_SERVICE_LINKUP_COMPLETE;
                GATTService_StoreDatabase(p_conn);

                LOG_INFO_APP("Discovered GATT Service\n");
                LOG_INFO_APP("StartHandle=%04d\n", p_conn->GattService.StartHandle);
                LOG_INFO_APP("EndHandle=%04d\n", p_conn->GattService.EndHandle);
                LOG_INFO_APP("ServiceChangedCharHandle=%04d\n", p_conn->GattService.ServiceChangedCharHandle);
                LOG_INFO_APP("ServiceChangedCharDescHandle=%04d\n", p_conn->GattService.ServiceChangedCharDescHandle);
              }
              TMAPAPP_Linkup(p_conn->ConnHandle);
            }
          }

          break;
        }
        /* USER CODE END ECODE_1 */
        default:
        {
          /* USER CODE BEGIN ECODE_DEFAULT */

          /* USER CODE END ECODE_DEFAULT */
          break;
        }
      }
      /* USER CODE BEGIN EVT_VENDOR_1 */

      /* USER CODE END EVT_VENDOR_1 */
    }
    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */
    default:
    {
      /* USER CODE BEGIN EVENT_PCKT_DEFAULT */

      /* USER CODE END EVENT_PCKT_DEFAULT */
      break;
    }
  }
  /* USER CODE BEGIN SVCCTL_App_Notification_1 */

  /* USER CODE END SVCCTL_App_Notification_1 */

  return (SVCCTL_UserEvtFlowEnable);
}

const uint8_t* BleGetBdAddress(void)
{
  const uint8_t *p_bd_addr;

  p_bd_addr = (const uint8_t *)a_BdAddr;

  return p_bd_addr;
}

/* USER CODE BEGIN FD */
tBleStatus SetGapAppearance(uint16_t Appearance)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(bleAppContext.GapServiceHandle,
                                   bleAppContext.GapAppearanceCharHandle,
                                   0,
                                   2,
                                   (uint8_t *)&Appearance);
  LOG_INFO_APP("Set Apperance %04X in Gap Database with status %d\n", Appearance, ret);

  return ret;
}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static uint8_t HOST_BLE_Init(void)
{
  tBleStatus return_status;

  pInitParams.numAttrRecord           = CFG_BLE_NUM_GATT_ATTRIBUTES;
  pInitParams.numAttrServ             = CFG_BLE_NUM_GATT_SERVICES;
  pInitParams.attrValueArrSize        = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
  pInitParams.prWriteListSize         = CFG_BLE_ATTR_PREPARE_WRITE_VALUE_SIZE;
  pInitParams.attMtu                  = CFG_BLE_ATT_MTU_MAX;
  pInitParams.max_coc_nbr             = CFG_BLE_COC_NBR_MAX;
  pInitParams.max_coc_mps             = CFG_BLE_COC_MPS_MAX;
  pInitParams.max_coc_initiator_nbr   = CFG_BLE_COC_INITIATOR_NBR_MAX;
  pInitParams.numOfLinks              = CFG_BLE_NUM_LINK;
  pInitParams.mblockCount             = CFG_BLE_MBLOCK_COUNT;
  pInitParams.bleStartRamAddress      = (uint8_t*)buffer;
  pInitParams.total_buffer_size       = BLE_DYN_ALLOC_SIZE;
  pInitParams.bleStartRamAddress_GATT = (uint8_t*)gatt_buffer;
  pInitParams.total_buffer_size_GATT  = BLE_GATT_BUF_SIZE;
  pInitParams.options                 = CFG_BLE_OPTIONS;
  pInitParams.debug                   = 0U;
/* USER CODE BEGIN HOST_BLE_Init_Params */

/* USER CODE END HOST_BLE_Init_Params */
  return_status = BleStack_Init(&pInitParams);
/* USER CODE BEGIN HOST_BLE_Init */

/* USER CODE END HOST_BLE_Init */
  return ((uint8_t)return_status);
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle = 0U, gap_dev_name_char_handle = 0U, gap_appearance_char_handle = 0U;
  const uint8_t *p_bd_addr;
  uint16_t a_appearance[1] = {CFG_GAP_APPEARANCE};
  const uint8_t *p_ir_value;
  const uint8_t *p_er_value;
  tBleStatus ret;

  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init */
  uint8_t a_hci_commandParams[8] = {0xFFu,0xF7u,0x86u,0xBFu,0x03u,0x00u,0x00u,0x00u};
  /* Mask the HAL Events*/
  aci_hal_set_event_mask(0x00000000);

  /**
   * Set LE Event Mask
   */
  hci_le_set_event_mask(&a_hci_commandParams[0]);
  /* USER CODE END Ble_Hci_Gap_Gatt_Init */

  LOG_INFO_APP("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

