STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_ble.c
  memcpy(&a_BLE_CfgErValue[0], a_cfg_er_value,16);

  if(memcmp(&a_BLE_CfgErValue[0], &a_BLE_CfgErValueNull[0], 16) != 0)
  {
    p_er_value = (const uint8_t *)a_BLE_CfgErValue;
  }
  else
  {
    uid_word1 = LL_GetUID_Word1();
    uid_word2 = LL_GetUID_Word2();

    /* USER CODE BEGIN BleGenerateERValue_2 */

    /* USER CODE END BleGenerateERValue_2 */

   if ((uid_word1 != 0xFFFFFFFF) && (uid_word2 != 0xFFFFFFFF))
    {

    /**
     * Encryption root key is built from bits of the UDN.
     */
      a_BLE_CfgErValue[0] = a_BLE_CfgErValue[8] = (uint8_t)(uid_word2 & 0x000000FF);
      a_BLE_CfgErValue[1] = a_BLE_CfgErValue[9] = (uint8_t)((uid_word2 & 0x0000FF00) >> 8);
      a_BLE_CfgErValue[2] = a_BLE_CfgErValue[10] = (uint8_t)((uid_word2 & 0x00FF0000) >> 16);
      a_BLE_CfgErValue[3] = a_BLE_CfgErValue[11] = (uint8_t)((uid_word2 & 0xFF000000) >> 24);
      a_BLE_CfgErValue[4] = a_BLE_CfgErValue[12] = (uint8_t)~(uid_word1 & 0x000000FF);
      a_BLE_CfgErValue[5] = a_BLE_CfgErValue[13] = (uint8_t)~((uid_word1 & 0x0000FF00) >> 8);
      a_BLE_CfgErValue[6] = a_BLE_CfgErValue[14] = (uint8_t)~((uid_word1 & 0x00FF0000) >> 16);
      a_BLE_CfgErValue[7] = a_BLE_CfgErValue[15] = (uint8_t)~((uid_word1 & 0xFF000000) >> 24);
      p_er_value = (const uint8_t *)a_BLE_CfgErValue;
    }
    else
    {
      memcpy(&a_BLE_CfgErValue[0], a_BLE_CfgErValueDefault,16);
      p_er_value = (const uint8_t *)a_BLE_CfgErValue;
    }
  }

  /* USER CODE BEGIN BleGenerateERValue_3 */

  /* USER CODE END BleGenerateERValue_3 */
  return p_er_value;
}

static void BleStack_Process_BG(void)
{
  if (BleStack_Process( ) == 0x0)
  {
    BleStackCB_Process( );
  }
}

/**
  * @brief  Notify the LL to resume the flow process
  * @param  None
  * @retval None
  */
static void BLE_ResumeFlowProcessCallback(void)
{
  /* Receive any events from the LL. */
  change_state_options_t notify_options;

  notify_options.combined_value = 0x0F;

  ll_intf_chng_evnt_hndlr_state( notify_options );
}

static void BLE_NvmCallback (SNVMA_Callback_Status_t CbkStatus)
{
  if (CbkStatus != SNVMA_OPERATION_COMPLETE)
  {
    /* Retry the write operation */
    SNVMA_Write (APP_BLE_NvmBuffer,
                 BLE_NvmCallback);
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static BleConn_t *Ble_GetConn(uint16_t ConnHandle)
{
  for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
  {
    if (bleAppContext.BleConn[conn].ConnHandle == ConnHandle)
    {
      return &bleAppContext.BleConn[conn];
    }
  }
  return 0;
}

static char Hex_To_Char(uint8_t Hex)
{
  if (Hex < 0xA)
  {
    return (char) Hex + 48;
  }
  else
  {
    return (char) Hex + 55;
  }
}

static void GATTService_StoreDatabase(BleConn_t *pConn)
{
#if (CFG_LOG_SUPPORTED != 0)
  tBleStatus status;
#endif /*(CFG_LOG_SUPPORTED != 0)*/
  uint8_t addr[6u];
  uint8_t type;
  uint8_t temp_database[GATTSERVICE_GATT_DATABASE_SIZE];
  uint32_t hdr[BLENVM_GATTSERVICE_HDR_LEN / 4];
  uint8_t mode = NVM_FIRST;
  int res;

  if (aci_gap_check_bonded_device(pConn->RemoteAddressType,
                                  &pConn->aRemoteAddress[0],
                                  &type,
                                  addr) == BLE_STATUS_SUCCESS)
  {
    temp_database[0] = pConn->GattService.StartHandle & 0xFF;
    temp_database[1] = (pConn->GattService.StartHandle >> 8) & 0xFF;
    temp_database[2] = pConn->GattService.EndHandle & 0xFF;
    temp_database[3] = (pConn->GattService.EndHandle >> 8) & 0xFF;
    temp_database[4] = pConn->GattService.ServiceChangedCharHandle & 0xFF;
    temp_database[5] = (pConn->GattService.ServiceChangedCharHandle >> 8) & 0xFF;
    temp_database[6] = pConn->GattService.ServiceChangedCharDescHandle & 0xFF;
    temp_database[7] = (pConn->GattService.ServiceChangedCharDescHandle >> 8) & 0xFF;

    while (1)
    {
      /* Get the header part of each record in order to find if there is already in NVM some data corresponding
       * to the same remote device address
       */
      res = NVM_Get(mode, GATTSERVICE_NVM_TYPE, 0, (uint8_t*)hdr, BLENVM_GATTSERVICE_HDR_LEN);
      mode = NVM_NEXT;
      if (res == NVM_EOF)
      {
        /* Reached EOF */
        break;
      }

      if (MEMCMP(&((uint8_t*)hdr)[1], addr, 6u) == 0)
      {
        break;
      }
    }

    if (res != NVM_EOF)
    {
      if (NVM_Compare(BLENVM_GATTSERVICE_HDR_LEN, temp_database, GATTSERVICE_GATT_DATABASE_SIZE) == 0)
      {
        /* No Database change */
        LOG_INFO_APP("No change in Gatt Service database\n");
        return;
      }

      /* Invalidate current record because data has changed */
      NVM_Discard(2);
      LOG_INFO_APP("Discard Gatt Service NVM Record\n");
    }

    ((uint8_t*)(hdr + 0))[0] = 0xFDU;
    ((uint8_t*)(hdr + 0))[1] = addr[0];
    ((uint8_t*)(hdr + 0))[2] = addr[1];
    ((uint8_t*)(hdr + 0))[3] = addr[2];
    ((uint8_t*)(hdr + 1))[0] = addr[3];
    ((uint8_t*)(hdr + 1))[1] = addr[4];
    ((uint8_t*)(hdr + 1))[2] = addr[5];
    ((uint8_t*)(hdr + 1))[3] = 0xFFU;

    hdr[2] = GATTSERVICE_GATT_DATABASE_SIZE;

#if (CFG_LOG_SUPPORTED != 0)
    status =
#endif /*(CFG_LOG_SUPPORTED != 0)*/
    NVM_Add( GATTSERVICE_NVM_TYPE,
            (uint8_t*)hdr,
            BLENVM_GATTSERVICE_HDR_LEN,
            temp_database,
            GATTSERVICE_GATT_DATABASE_SIZE );
    LOG_INFO_APP("Added Gatt Service NVM record with status 0x%02X\n", status);
  }
}

static void GATTService_RestoreDatabase(BleConn_t *pConn)
{
  uint8_t type;
  uint8_t addr[6u];
  uint8_t temp_database[GATTSERVICE_GATT_DATABASE_SIZE] = {0};
  int res;
  uint8_t mode = NVM_FIRST;
  uint32_t hdr[BLENVM_GATTSERVICE_HDR_LEN / 4];

  if (aci_gap_check_bonded_device(pConn->RemoteAddressType,
                                  &pConn->aRemoteAddress[0],
                                  &type,
                                  addr) == BLE_STATUS_SUCCESS)
  {

    while (1)
    {
      /* Get the header part of each record in order to find if there is already in NVM some data corresponding
       * to the same remote device address
       */
      res = NVM_Get( mode, GATTSERVICE_NVM_TYPE,0, (uint8_t*)hdr, BLENVM_GATTSERVICE_HDR_LEN );
      mode = NVM_NEXT;
      if (res == NVM_EOF)
      {
        /* Reached EOF */
        break;
      }

      if (MEMCMP(&((uint8_t*)hdr)[1], addr, 6u) == 0)
      {
        /* Found Record */
        break;
      }
    }

    if (res != NVM_EOF)
    {
      (void) NVM_Get(0, GATTSERVICE_NVM_TYPE, BLENVM_GATTSERVICE_HDR_LEN, temp_database, GATTSERVICE_GATT_DATABASE_SIZE);

      pConn->GattService.StartHandle = temp_database[0] + (temp_database[1] << 8);
      pConn->GattService.EndHandle = temp_database[2] + (temp_database[3] << 8);
      pConn->GattService.ServiceChangedCharHandle = temp_database[4] + (temp_database[5] << 8);
      pConn->GattService.ServiceChangedCharDescHandle = temp_database[6] + (temp_database[7] << 8);

      LOG_INFO_APP("Restored GATT Service\n");
      LOG_INFO_APP("StartHandle=%04d\n", pConn->GattService.StartHandle);
      LOG_INFO_APP("EndHandle=%04d\n", pConn->GattService.EndHandle);
      LOG_INFO_APP("ServiceChangedCharHandle=%04d\n", pConn->GattService.ServiceChangedCharHandle);
      LOG_INFO_APP("ServiceChangedCharDescHandle=%04d\n", pConn->GattService.ServiceChangedCharDescHandle);

      pConn->GattService.LinkupState = GATT_SERVICE_LINKUP_COMPLETE;
    }
  }
}

/* USER CODE END FD_LOCAL_FUNCTION */

